# Алдыңғы жағдайдағыдай пайдаланушыдан бүтін сандарды сұрайтын
# жəне оларды тізім ретінде сақтайтын бағдарламаны жазыңыз. Нөл мəндерді
# енгізудің аяқталуының көрсеткіші ретінде де қызмет етуі керек. Бұл жолы
# енгізілген мəндерді кему ретімен көрсету қажет.
# Напишите программу, которая, как и в предыдущем случае, будет
# запрашивать у пользователя целые числа и сохранять их в виде списка.
# Индикатором окончания ввода значений также должен служить ноль. На
# этот раз необходимо вывести на экран введенные значения в порядке
# убывания.



numbers = []
while True:
    num = int(input('Butin san engiziniz (nemese toqtatu ushin "0"): '))
    if num == 0:
        break
    numbers.append(num)

# Suryptap shygaru
numbers.sort(reverse=True)
print("Kemu retimen: ")
for num in numbers:
    print(num)
