# Бас жүлдені ұтып алу үшін лотерея билетіндегі алты нөмір келесі
# ұтыс ойынында 1-ден 49-ға дейінгі аралықта кездейсоқ алынған алты нөмірге
# сəйкес келуі керек. Билетіңізге алты санды кездейсоқ таңдайтын бағдарлама
# жазыңыз. Бұл сандар арасында көшірмелердің жоқтығына көз жеткізіңіз.
# Экранда билет нөмірлерін өсу ретімен көрсетіңіз.
# Для выигрыша главного приза необходимо, чтобы шесть номеров на
# лотерейном билете совпали с шестью числами, выпавшими случайным
# образом в диапазоне от 1 до 49 во время очередного тиража. Напишите
# программу, которая будет случайным образом подбирать шесть номеров
# для вашего билета. Убедитесь в том, что среди этих чисел не будет
# дубликатов. Выведите номера билетов на экран по возрастанию.


import random

my_bilet = int(input("Menin biletim: "))
# 1 men 49 arasynda 6 erekshe san jasaimyz
numbers = random.sample(range(1, 50), 6)

# Osu retimen suryptau
numbers.sort()
if my_bilet == numbers.sort():
    print(my_bilet, "Siz jendiniz!!!")
else:
    print(my_bilet, "Okinishke orai siz jenbediniz")
# Natizheni shygaru
print("Bilet nomeri:", numbers)
