# Пайдаланушыға бүтін мəндерді сұрайтын жəне оларды тізім ретінде
# сақтайтын бағдарламаны жазыңыз. Мəндерді енгізудің аяқталуының
# көрсеткіші ретінде нөлді пайдалану керек. Содан кейін бағдарлама
# пайдаланушы енгізген барлық сандарды (нөлден басқа) өсу ретімен көрсетуі
# керек - əр жолға бір мəн. Сұрыптау үшін sort əдісін немесе sorted функцияны
# пайдаланыңыз.
# Напишите программу, которая будет запрашивать у пользователя
# целочисленные значения и сохранять их в виде списка. Индикатором
# окончания ввода значений должен служить ноль. Затем программа должна
# вывести на экран все введенные пользователем числа (кроме нуля) в порядке
# возрастания – по одному значению в строке. Используйте для сортировки
# либо метод sort, либо функцию sorted.


# Bos tizim jasaimyz
numbers = []

# Tizimdi sandarmen toltyramyz, 0 jazylsa toqtaimyz
while True:
    num = int(input('Butin san engiziniz (nemese toqtatu ushin "0"): '))
    if num == 0:
        break
    numbers.append(num)

# Tizimdi osu reti boiynsha syryptaimyz
numbers.sort()

print('\n')

# Natizheni shygaramyz
for num in numbers:
    print(num)
